In [ ]:
# Bismillah

In [1]:
import numpy as np
import pandas as pd

# The DataFrame
    * A combination of multiple series, each series is a seperate column.
    * A two-dimensional array.
    * Has two axes, horizontal and vertical. 
        * Allows to apply operations on the selected rows or columns.m

# Create DataFrame

In [2]:
# Method 1: Using numpy array.

np.array([[10, 11], [20, 21]])
# 2-D array.

array([[10, 11],
       [20, 21]])

In [3]:
type(np.array([[10, 11], [20, 21]]))

numpy.ndarray

In [4]:
df = pd.DataFrame(np.array([[10, 11], [20, 21]]))
df
# create dataframe using numpy array. np.array([[10, 11], [20, 21]] evaluates to a list of lists as can be seen above.

    0   1
0  10  11
1  20  21

In [5]:
# Method 2: Using pandas series.
s1 = pd.Series([10, 11])
s1
# indices already assigned.

0    10
1    11
dtype: int64

In [6]:
s2 = pd.Series([20, 21])
s2
# indices already assigned.

0    20
1    21
dtype: int64

In [7]:
df = pd.DataFrame([s1, s2])
df
# No [] around s1 and s2 since they are aleady two distinct series. df = pd.DataFrame([[10, 11], [20, 21]])
# create dataframe using series.

    0   1
0  10  11
1  20  21

In [8]:
# Method 3: Using dictionary.

df = pd.DataFrame({0: [10, 20], 1: [11, 21]})
df
# create dataframe using dictionary. The keys are the column headings.

    0   1
0  10  11
1  20  21

In [20]:
# Method 4: Using combination of pandas series and dictionary.

s1 = pd.Series(np.arange(1, 6, 1))
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [17]:
s2 = pd.Series(np.arange(6, 11, 1))
s2

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [21]:
df = pd.DataFrame({'a': s1, 'b': s2})
df
# keys are the column headings.
# create dataframe through a combination of pandas series and dictionary.

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [22]:
s3 = pd.Series(np.arange(12, 14, 1), index = [1, 2])
s3

1    12
2    13
dtype: int64

In [23]:
df = pd.DataFrame({'a': s1, 'b': s2, 'c': s3})
df
# Third column added with correct allignment. 'NaN' inserted for missing values.

   a   b     c
0  1   6   NaN
1  2   7  12.0
2  3   8  13.0
3  4   9   NaN
4  5  10   NaN

In [24]:
# Method 5: Using a list of lists.

df = pd.DataFrame([[10, 11], [20, 21]])
df
# create dataframe using a list of lists.
# default argument for columns is: columns = [0, 1]
# default row indexing is: index = [0, 1]

    0   1
0  10  11
1  20  21

In [25]:
df = pd.DataFrame([[10, 11], [20, 21]], index = ['R1', 'R2'], columns = ['a', 'b'])
df
# the default arrangements changed and customized at the time of constructing dataframe.

     a   b
R1  10  11
R2  20  21

In [26]:
df.index = ['r1', 'r2']
df.columns = ['c1', 'c2']
df
# changes made through assignment operator later on.

    c1  c2
r1  10  11
r2  20  21

In [27]:
df.shape
# 2 rows and 2 columns.

(2, 2)

In [ ]:
df.columns
# column headings/variable names.

In [ ]:
df.index
# row indices

In [ ]:
df.values

In [ ]:
df.info()

# Selecting columns and rows of a DataFrame
    * Selecting column rquires [] operator.
    * Secting row requires iloc, loc or slicing with [] operator.

In [ ]:
df

In [ ]:
# Selecting Only Columns

In [ ]:
df['c1']
# grab the column.
# df[column or columns]. No argument for the row or rows except in loc, iloc, or slicing in [] operator.

In [ ]:
# df['c1', 'c2'] 
# error since no column titled, c1 c2, exisits.

In [ ]:
df[['c1', 'c2']]
# the inner [] indicates that c1 and c2 are two columns to look for.

In [ ]:
df.c1
# same as df['c1'] but not advisable since a column name may accidently match a builit-in attribute.

In [ ]:
# Slecting Rows with slicing in [] operator

In [ ]:
df['r1':'r2']
# Example of [] with slicing for rows. Also, due to (:), no inner [] needed for clarification.
# This kind of slicing only permitted for rows.

In [ ]:
df[:1] # again slicing for rows with [].

In [ ]:
# Selecting combination of rows and columns.

In [ ]:
df.iloc[0]
# iloc[row or rows, column or columns]. 0 taken as an argument for row. Column argument is optional.
# Also, iloc is for integer location and accepts only integers as index positions.

In [ ]:
df.iloc[0, 1]
# 0 is an argument for row and after comma 1 is argument for column. COMMA distinguishes between the arguments for rows
# and columns.
# gives a scalar value.

In [ ]:
df.iloc[[0, 1]]
# 0 and 1 are both arguments for row. The columns arguments can be given after COMMA put after inner [].

In [ ]:
df.iloc[[0, 1], 1]
# [0, 1] are arguements for rows. 1 after comma after [] is the argument for column.

In [ ]:
df.iloc[0, [0, 1]]
# 0 is an argument for row, and [0, 1] are arguments for column.

In [ ]:
df.iloc[[0, 1], [0, 1]]
# first [0, 1] is an argument for rows and the second [0, 1] after middle comma is an argument for columns.

In [ ]:
# sp500.iloc[0, 1, 1] # Indexting error: Too many indexers, 0 for row, first 1 for column, and and second 1 extra.

In [ ]:
#sp500.iloc[0, 1, [0, 1]] # Indexting error: Too many indexers, 0 for row, 1 for column, and [0, 1] is extra.